addons/l10n_account_edi_ubl_cii_tests/tests/test_files/from_peppol-bis-invoice-3_doc/bis3_allowance.xml

<?xmlversion="1.0"encoding="UTF-8"?>
<Invoicexmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2"
    xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2"
    xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2">
    <cbc:CustomizationID>urn:cen.eu:en16931:2017#compliant#urn:fdc:peppol.eu:2017:poacc:billing:3.0</cbc:CustomizationID>
    <cbc:ProfileID>urn:fdc:peppol.eu:2017:poacc:billing:01:1.0</cbc:ProfileID>
    <cbc:ID>Snippet1</cbc:ID>
    <cbc:IssueDate>2017-11-13</cbc:IssueDate>
    <cbc:DueDate>2017-12-01</cbc:DueDate>
    <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
    <cbc:Note>Pleasenotewehaveanewphonenumber:22222222</cbc:Note>
    <cbc:TaxPointDate>2017-12-01</cbc:TaxPointDate>
    <cbc:DocumentCurrencyCode>EUR</cbc:DocumentCurrencyCode>
    <cbc:TaxCurrencyCode>SEK</cbc:TaxCurrencyCode>
    <cbc:AccountingCost>4025:123:4343</cbc:AccountingCost>
    <cbc:BuyerReference>0150abc</cbc:BuyerReference>
    <cac:InvoicePeriod>
        <cbc:StartDate>2017-12-01</cbc:StartDate>
        <cbc:EndDate>2017-12-31</cbc:EndDate>
    </cac:InvoicePeriod>
    <cac:ContractDocumentReference>
        <cbc:ID>frameworkno1</cbc:ID>
    </cac:ContractDocumentReference>
    <cac:AdditionalDocumentReference>
        <cbc:IDschemeID="ABT">DR35141</cbc:ID>
        <cbc:DocumentTypeCode>130</cbc:DocumentTypeCode>
    </cac:AdditionalDocumentReference>
    <cac:AdditionalDocumentReference>
        <cbc:ID>ts12345</cbc:ID>
        <cbc:DocumentDescription>Technicalspecification</cbc:DocumentDescription>
        <cac:Attachment>
            <cac:ExternalReference>
                <cbc:URI>www.techspec.no</cbc:URI>
            </cac:ExternalReference>
        </cac:Attachment>
    </cac:AdditionalDocumentReference>
    <cac:AccountingSupplierParty>
        <cac:Party>
            <cbc:EndpointIDschemeID="0088">7300010000001</cbc:EndpointID>
            <cac:PartyIdentification>
                <cbc:ID>99887766</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>SupplierTradingNameLtd.</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cbc:StreetName>Mainstreet1</cbc:StreetName>
                <cbc:AdditionalStreetName>Postbox123</cbc:AdditionalStreetName>
                <cbc:CityName>London</cbc:CityName>
                <cbc:PostalZone>GB123EW</cbc:PostalZone>
                <cac:Country>
                    <cbc:IdentificationCode>GB</cbc:IdentificationCode>
                </cac:Country>
            </cac:PostalAddress>
            <cac:PartyTaxScheme>
                <cbc:CompanyID>GB1232434</cbc:CompanyID>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
          
            <cac:PartyLegalEntity>
                <cbc:RegistrationName>SupplierOfficialNameLtd</cbc:RegistrationName>
                <cbc:CompanyID>GB983294</cbc:CompanyID>
                <cbc:CompanyLegalForm>AdditionalLegalInformation</cbc:CompanyLegalForm>  
            </cac:PartyLegalEntity>

        </cac:Party>
    </cac:AccountingSupplierParty>

    <cac:AccountingCustomerParty>
        <cac:Party>
            <cbc:EndpointIDschemeID="0002">4598375937</cbc:EndpointID>
            <cac:PartyIdentification>
                <cbc:IDschemeID="0002">4598375937</cbc:ID>
            </cac:PartyIdentification>
            <cac:PartyName>
                <cbc:Name>BuyerTradingNameAS</cbc:Name>
            </cac:PartyName>
            <cac:PostalAddress>
                <cbc:StreetName>Hovedgatan32</cbc:StreetName>
                <cbc:AdditionalStreetName>Pobox878</cbc:AdditionalStreetName>
                <cbc:CityName>Stockholm</cbc:CityName>
                <cbc:PostalZone>45634</cbc:PostalZone>
                <cbc:CountrySubentity>Södermalm</cbc:CountrySubentity>
  
                <cac:Country>
                    <cbc:IdentificationCode>SE</cbc:IdentificationCode>
                </cac:Country>
            </cac:PostalAddress>
            <cac:PartyTaxScheme>
                <cbc:CompanyID>SE4598375937</cbc:CompanyID>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:PartyTaxScheme>
            <cac:PartyLegalEntity>
                <cbc:RegistrationName>BuyerOfficialName</cbc:RegistrationName>
                <cbc:CompanyIDschemeID="0183">39937423947</cbc:CompanyID>
            </cac:PartyLegalEntity>
            <cac:Contact>
                <cbc:Name>LisaJohnson</cbc:Name>
                <cbc:Telephone>23434234</cbc:Telephone>
                <cbc:ElectronicMail>lj@buyer.se</cbc:ElectronicMail>
            </cac:Contact>
        </cac:Party>
    </cac:AccountingCustomerParty>
    <cac:Delivery>
        <cbc:ActualDeliveryDate>2017-11-01</cbc:ActualDeliveryDate>
        <cac:DeliveryLocation>
            <cbc:IDschemeID="0088">7300010000001</cbc:ID>
            <cac:Address>
                <cbc:StreetName>Deliverystreet2</cbc:StreetName>
                <cbc:AdditionalStreetName>Building56</cbc:AdditionalStreetName>
                <cbc:CityName>Stockholm</cbc:CityName>
                <cbc:PostalZone>21234</cbc:PostalZone>
                <cbc:CountrySubentity>Södermalm</cbc:CountrySubentity>
                <cac:AddressLine>
                    <cbc:Line>Gate15</cbc:Line>
                </cac:AddressLine>
                <cac:Country>
                    <cbc:IdentificationCode>SE</cbc:IdentificationCode>
                </cac:Country>
            </cac:Address>
        </cac:DeliveryLocation>
        <cac:DeliveryParty>
            <cac:PartyName>
                <cbc:Name>DeliverypartyName</cbc:Name>
            </cac:PartyName>
        </cac:DeliveryParty>
    </cac:Delivery>
    <cac:PaymentMeans>
        <cbc:PaymentMeansCodename="Credittransfer">30</cbc:PaymentMeansCode>
        <cbc:PaymentID>Snippet1</cbc:PaymentID>
        <cac:PayeeFinancialAccount>
            <cbc:ID>IBAN32423940</cbc:ID>
            <cbc:Name>AccountName</cbc:Name>
            <cac:FinancialInstitutionBranch>
                <cbc:ID>BIC324098</cbc:ID>
            </cac:FinancialInstitutionBranch>
        </cac:PayeeFinancialAccount>
    </cac:PaymentMeans>
    <cac:PaymentTerms>
        <cbc:Note>Paymentwithin10days,2%discount</cbc:Note>
    </cac:PaymentTerms>

    <cac:AllowanceCharge>
        <cbc:ChargeIndicator>true</cbc:ChargeIndicator>
        <cbc:AllowanceChargeReasonCode>CG</cbc:AllowanceChargeReasonCode>
        <cbc:AllowanceChargeReason>Cleaning</cbc:AllowanceChargeReason>
        <cbc:MultiplierFactorNumeric>20</cbc:MultiplierFactorNumeric>
        <cbc:AmountcurrencyID="EUR">200</cbc:Amount>
        <cbc:BaseAmountcurrencyID="EUR">1000</cbc:BaseAmount>
        <cac:TaxCategory>
            <cbc:ID>S</cbc:ID>
            <cbc:Percent>25</cbc:Percent>
            <cac:TaxScheme>
                <cbc:ID>VAT</cbc:ID>
            </cac:TaxScheme>
        </cac:TaxCategory>
    </cac:AllowanceCharge>

    <cac:AllowanceCharge>
        <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
        <cbc:AllowanceChargeReasonCode>95</cbc:AllowanceChargeReasonCode>
        <cbc:AllowanceChargeReason>Discount</cbc:AllowanceChargeReason>
        <cbc:AmountcurrencyID="EUR">200</cbc:Amount>
        <cac:TaxCategory>
            <cbc:ID>S</cbc:ID>
            <cbc:Percent>25</cbc:Percent>
            <cac:TaxScheme>
                <cbc:ID>VAT</cbc:ID>
            </cac:TaxScheme>
        </cac:TaxCategory>
    </cac:AllowanceCharge>

    <cac:TaxTotal>
        <cbc:TaxAmountcurrencyID="EUR">1225.00</cbc:TaxAmount>
        <cac:TaxSubtotal>
            <cbc:TaxableAmountcurrencyID="EUR">4900.0</cbc:TaxableAmount>
            <cbc:TaxAmountcurrencyID="EUR">1225</cbc:TaxAmount>
            <cac:TaxCategory>
                <cbc:ID>S</cbc:ID>
                <cbc:Percent>25</cbc:Percent>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
        <cac:TaxSubtotal>
            <cbc:TaxableAmountcurrencyID="EUR">1000.0</cbc:TaxableAmount>
            <cbc:TaxAmountcurrencyID="EUR">0</cbc:TaxAmount>
            <cac:TaxCategory>
                <cbc:ID>E</cbc:ID>
                <cbc:Percent>0</cbc:Percent>
                <cbc:TaxExemptionReason>Reasonfortaxexempt</cbc:TaxExemptionReason>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:TaxCategory>
        </cac:TaxSubtotal>
    </cac:TaxTotal>
    <cac:TaxTotal>
        <cbc:TaxAmountcurrencyID="SEK">9324.00</cbc:TaxAmount>
    </cac:TaxTotal>
    
    <cac:LegalMonetaryTotal>
        <cbc:LineExtensionAmountcurrencyID="EUR">5900</cbc:LineExtensionAmount>
        <cbc:TaxExclusiveAmountcurrencyID="EUR">5900</cbc:TaxExclusiveAmount>
        <cbc:TaxInclusiveAmountcurrencyID="EUR">7125</cbc:TaxInclusiveAmount>
        <cbc:AllowanceTotalAmountcurrencyID="EUR">200</cbc:AllowanceTotalAmount>
        <cbc:ChargeTotalAmountcurrencyID="EUR">200</cbc:ChargeTotalAmount>
        <cbc:PrepaidAmountcurrencyID="EUR">1000</cbc:PrepaidAmount>
        <cbc:PayableAmountcurrencyID="EUR">6125.00</cbc:PayableAmount>
    </cac:LegalMonetaryTotal>

    <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
        <cbc:Note>Testingnoteonlinelevel</cbc:Note>
        <cbc:InvoicedQuantityunitCode="C62">10</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmountcurrencyID="EUR">4000.00</cbc:LineExtensionAmount>
        <cbc:AccountingCost>Konteringsstreng</cbc:AccountingCost>
        <cac:AllowanceCharge>
            <cbc:ChargeIndicator>true</cbc:ChargeIndicator>
            <cbc:AllowanceChargeReasonCode>CG</cbc:AllowanceChargeReasonCode>
            <cbc:AllowanceChargeReason>Cleaning</cbc:AllowanceChargeReason>
            <cbc:MultiplierFactorNumeric>1</cbc:MultiplierFactorNumeric>
            <cbc:AmountcurrencyID="EUR">1</cbc:Amount>
            <cbc:BaseAmountcurrencyID="EUR">100</cbc:BaseAmount>
        </cac:AllowanceCharge>
        <cac:AllowanceCharge>
            <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
            <cbc:AllowanceChargeReasonCode>95</cbc:AllowanceChargeReasonCode>
            <cbc:AllowanceChargeReason>Discount</cbc:AllowanceChargeReason>
            <cbc:AmountcurrencyID="EUR">101</cbc:Amount>
        </cac:AllowanceCharge>
        <cac:Item>
            <cbc:Description>DescriptionofitemA</cbc:Description>
            <cbc:Name>itemname</cbc:Name>
        
            <cac:SellersItemIdentification>
                <cbc:ID>97iugug876</cbc:ID>
            </cac:SellersItemIdentification>
           <cac:OriginCountry>
                <cbc:IdentificationCode>NO</cbc:IdentificationCode>
            </cac:OriginCountry>
            <cac:CommodityClassification>
                <cbc:ItemClassificationCodelistID="SRV">09348023</cbc:ItemClassificationCode>
            </cac:CommodityClassification>
            <cac:ClassifiedTaxCategory>
                <cbc:ID>S</cbc:ID>
                <cbc:Percent>25.0</cbc:Percent>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:ClassifiedTaxCategory>
     
        </cac:Item>

        <cac:Price>
            <cbc:PriceAmountcurrencyID="EUR">410</cbc:PriceAmount>
            <cbc:BaseQuantityunitCode="C62">1</cbc:BaseQuantity>
            <cac:AllowanceCharge>
                <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
                <cbc:AmountcurrencyID="EUR">40</cbc:Amount>
                <cbc:BaseAmountcurrencyID="EUR">450</cbc:BaseAmount>
            </cac:AllowanceCharge>
        </cac:Price>

    </cac:InvoiceLine>
    <cac:InvoiceLine>
        <cbc:ID>2</cbc:ID>
        <cbc:Note>Testingnoteonlinelevel</cbc:Note>

        <cbc:InvoicedQuantityunitCode="C62">10</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmountcurrencyID="EUR">1000.00</cbc:LineExtensionAmount>

        <cbc:AccountingCost>Konteringsstreng</cbc:AccountingCost>
        <cac:InvoicePeriod>
            <cbc:StartDate>2017-12-01</cbc:StartDate>
            <cbc:EndDate>2017-12-05</cbc:EndDate>
        </cac:InvoicePeriod>
        <cac:OrderLineReference>
            <cbc:LineID>124</cbc:LineID>
        </cac:OrderLineReference>

        <cac:Item>
            <cbc:Description>DescriptionofitemB</cbc:Description>
            <cbc:Name>itemname</cbc:Name>
            <cac:SellersItemIdentification>
                <cbc:ID>97iugug876</cbc:ID>
            </cac:SellersItemIdentification>
            <cac:CommodityClassification>
                <cbc:ItemClassificationCodelistID="SRV">86776</cbc:ItemClassificationCode>
            </cac:CommodityClassification>
            <cac:ClassifiedTaxCategory>
                <cbc:ID>E</cbc:ID>
                <cbc:Percent>0.0</cbc:Percent>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:ClassifiedTaxCategory>
            <cac:AdditionalItemProperty>
                <cbc:Name>AdditionalItemName</cbc:Name>
                <cbc:Value>AdditionalItemValue</cbc:Value>
            </cac:AdditionalItemProperty>
        </cac:Item>
        <cac:Price>
            <cbc:PriceAmountcurrencyID="EUR">200</cbc:PriceAmount>
            <cbc:BaseQuantityunitCode="C62">2</cbc:BaseQuantity>
        </cac:Price>
    </cac:InvoiceLine>
    <cac:InvoiceLine>
        <cbc:ID>3</cbc:ID>
        <cbc:Note>Testingnoteonlinelevel</cbc:Note>
        <cbc:InvoicedQuantityunitCode="C62">10</cbc:InvoicedQuantity>
        <cbc:LineExtensionAmountcurrencyID="EUR">900.00</cbc:LineExtensionAmount>
        <cbc:AccountingCost>Konteringsstreng</cbc:AccountingCost>
        <cac:InvoicePeriod>
            <cbc:StartDate>2017-12-01</cbc:StartDate>
            <cbc:EndDate>2017-12-05</cbc:EndDate>
        </cac:InvoicePeriod>
        <cac:OrderLineReference>
            <cbc:LineID>124</cbc:LineID>
        </cac:OrderLineReference>

        <cac:AllowanceCharge>
            <cbc:ChargeIndicator>true</cbc:ChargeIndicator>
            <cbc:AllowanceChargeReasonCode>CG</cbc:AllowanceChargeReasonCode>
            <cbc:AllowanceChargeReason>Charge</cbc:AllowanceChargeReason>
            <cbc:MultiplierFactorNumeric>1</cbc:MultiplierFactorNumeric>
            <cbc:AmountcurrencyID="EUR">1</cbc:Amount>
            <cbc:BaseAmountcurrencyID="EUR">100</cbc:BaseAmount>
        </cac:AllowanceCharge>
        <cac:AllowanceCharge>
            <cbc:ChargeIndicator>false</cbc:ChargeIndicator>
            <cbc:AllowanceChargeReasonCode>95</cbc:AllowanceChargeReasonCode>
            <cbc:AllowanceChargeReason>Discount</cbc:AllowanceChargeReason>
            <cbc:AmountcurrencyID="EUR">101</cbc:Amount>
        </cac:AllowanceCharge>
 
        <cac:Item>
            <cbc:Description>DescriptionofitemC</cbc:Description>
            <cbc:Name>itemname</cbc:Name>
            <cac:SellersItemIdentification>
                <cbc:ID>97iugug876</cbc:ID>
            </cac:SellersItemIdentification>

            <cac:CommodityClassification>
                <cbc:ItemClassificationCodelistID="SRV">86776</cbc:ItemClassificationCode>
            </cac:CommodityClassification>
            <cac:ClassifiedTaxCategory>
                <cbc:ID>S</cbc:ID>
                <cbc:Percent>25.0</cbc:Percent>
                <cac:TaxScheme>
                    <cbc:ID>VAT</cbc:ID>
                </cac:TaxScheme>
            </cac:ClassifiedTaxCategory>
            <cac:AdditionalItemProperty>
                <cbc:Name>AdditionalItemName</cbc:Name>
                <cbc:Value>AdditionalItemValue</cbc:Value>
            </cac:AdditionalItemProperty>
        </cac:Item>

        <cac:Price>
            <cbc:PriceAmountcurrencyID="EUR">100</cbc:PriceAmount>
        </cac:Price>

    </cac:InvoiceLine>   
</Invoice>
